{
    "architectures": [
        "Lfm2ForCausalLM"
    ],
    "attn_implementation": "flash_attention_2",
    "block_auto_adjust_ff_dim": true,
    "block_dim": 1024,
    "block_ff_dim": 6656,
    "block_ffn_dim_multiplier": 1.0,
    "block_mlp_init_scale": 1.0,
    "block_multiple_of": 256,
    "block_norm_eps": 1e-05,
    "block_out_init_scale": 1.0,
    "block_use_swiglu": true,
    "block_use_xavier_init": true,
    "bos_token_id": 1,
    "conv_L_cache": 3,
    "conv_bias": false,
    "conv_dim": 1024,
    "conv_use_xavier_init": true,
    "dtype": "bfloat16",
    "eos_token_id": 7,
    "hidden_size": 1024,
    "initializer_range": 0.02,
    "intermediate_size": 6656,
    "layer_types": [
        "conv",
        "conv",
        "full_attention",
        "conv",
        "conv",
        "full_attention",
        "conv",
        "conv",
        "full_attention",
        "conv",
        "full_attention",
        "conv",
        "full_attention",
        "conv",
        "full_attention",
        "conv"
    ],
    "max_position_embeddings": 128000,
    "model_type": "lfm2",
    "norm_eps": 1e-05,
    "num_attention_heads": 16,
    "num_heads": 16,
    "num_hidden_layers": 16,
    "num_key_value_heads": 8,
    "pad_token_id": 0,
    "quantization": {
        "group_size": 64,
        "bits": 4,
        "mode": "affine"
    },
    "quantization_config": {
        "group_size": 64,
        "bits": 4,
        "mode": "affine"
    },
    "rope_parameters": {
        "rope_theta": 1000000.0,
        "rope_type": "default"
    },
    "rope_theta": 1000000.0,
    "tie_embedding": true,
    "transformers_version": "4.57.1",
    "use_cache": true,
    "use_pos_enc": true,
    "vocab_size": 65536
}