{
    "metadata": {
        "total_size": 221772800,
        "total_parameters": 354483968
    },
    "weight_map": {
        "model.embed_tokens.biases": "model.safetensors",
        "model.embed_tokens.scales": "model.safetensors",
        "model.embed_tokens.weight": "model.safetensors",
        "model.embedding_norm.weight": "model.safetensors",
        "model.layers.0.conv.conv.weight": "model.safetensors",
        "model.layers.0.conv.in_proj.biases": "model.safetensors",
        "model.layers.0.conv.in_proj.scales": "model.safetensors",
        "model.layers.0.conv.in_proj.weight": "model.safetensors",
        "model.layers.0.conv.out_proj.biases": "model.safetensors",
        "model.layers.0.conv.out_proj.scales": "model.safetensors",
        "model.layers.0.conv.out_proj.weight": "model.safetensors",
        "model.layers.0.feed_forward.w1.biases": "model.safetensors",
        "model.layers.0.feed_forward.w1.scales": "model.safetensors",
        "model.layers.0.feed_forward.w1.weight": "model.safetensors",
        "model.layers.0.feed_forward.w2.biases": "model.safetensors",
        "model.layers.0.feed_forward.w2.scales": "model.safetensors",
        "model.layers.0.feed_forward.w2.weight": "model.safetensors",
        "model.layers.0.feed_forward.w3.biases": "model.safetensors",
        "model.layers.0.feed_forward.w3.scales": "model.safetensors",
        "model.layers.0.feed_forward.w3.weight": "model.safetensors",
        "model.layers.0.ffn_norm.weight": "model.safetensors",
        "model.layers.0.operator_norm.weight": "model.safetensors",
        "model.layers.1.conv.conv.weight": "model.safetensors",
        "model.layers.1.conv.in_proj.biases": "model.safetensors",
        "model.layers.1.conv.in_proj.scales": "model.safetensors",
        "model.layers.1.conv.in_proj.weight": "model.safetensors",
        "model.layers.1.conv.out_proj.biases": "model.safetensors",
        "model.layers.1.conv.out_proj.scales": "model.safetensors",
        "model.layers.1.conv.out_proj.weight": "model.safetensors",
        "model.layers.1.feed_forward.w1.biases": "model.safetensors",
        "model.layers.1.feed_forward.w1.scales": "model.safetensors",
        "model.layers.1.feed_forward.w1.weight": "model.safetensors",
        "model.layers.1.feed_forward.w2.biases": "model.safetensors",
        "model.layers.1.feed_forward.w2.scales": "model.safetensors",
        "model.layers.1.feed_forward.w2.weight": "model.safetensors",
        "model.layers.1.feed_forward.w3.biases": "model.safetensors",
        "model.layers.1.feed_forward.w3.scales": "model.safetensors",
        "model.layers.1.feed_forward.w3.weight": "model.safetensors",
        "model.layers.1.ffn_norm.weight": "model.safetensors",
        "model.layers.1.operator_norm.weight": "model.safetensors",
        "model.layers.10.feed_forward.w1.biases": "model.safetensors",
        "model.layers.10.feed_forward.w1.scales": "model.safetensors",
        "model.layers.10.feed_forward.w1.weight": "model.safetensors",
        "model.layers.10.feed_forward.w2.biases": "model.safetensors",
        "model.layers.10.feed_forward.w2.scales": "model.safetensors",
        "model.layers.10.feed_forward.w2.weight": "model.safetensors",
        "model.layers.10.feed_forward.w3.biases": "model.safetensors",
        "model.layers.10.feed_forward.w3.scales": "model.safetensors",
        "model.layers.10.feed_forward.w3.weight": "model.safetensors",
        "model.layers.10.ffn_norm.weight": "model.safetensors",
        "model.layers.10.operator_norm.weight": "model.safetensors",
        "model.layers.10.self_attn.k_layernorm.weight": "model.safetensors",
        "model.layers.10.self_attn.k_proj.biases": "model.safetensors",
        "model.layers.10.self_attn.k_proj.scales": "model.safetensors",
        "model.layers.10.self_attn.k_proj.weight": "model.safetensors",
        "model.layers.10.self_attn.out_proj.biases": "model.safetensors",
        "model.layers.10.self_attn.out_proj.scales": "model.safetensors",
        "model.layers.10.self_attn.out_proj.weight": "model.safetensors",
        "model.layers.10.self_attn.q_layernorm.weight": "model.safetensors",
        "model.layers.10.self_attn.q_proj.biases": "model.safetensors",
        "model.layers.10.self_attn.q_proj.scales": "model.safetensors",
        "model.layers.10.self_attn.q_proj.weight": "model.safetensors",
        "model.layers.10.self_attn.v_proj.biases": "model.safetensors",
        "model.layers.10.self_attn.v_proj.scales": "model.safetensors",
        "model.layers.10.self_attn.v_proj.weight": "model.safetensors",
        "model.layers.11.conv.conv.weight": "model.safetensors",
        "model.layers.11.conv.in_proj.biases": "model.safetensors",
        "model.layers.11.conv.in_proj.scales": "model.safetensors",
        "model.layers.11.conv.in_proj.weight": "model.safetensors",
        "model.layers.11.conv.out_proj.biases": "model.safetensors",
        "model.layers.11.conv.out_proj.scales": "model.safetensors",
        "model.layers.11.conv.out_proj.weight": "model.safetensors",
        "model.layers.11.feed_forward.w1.biases": "model.safetensors",
        "model.layers.11.feed_forward.w1.scales": "model.safetensors",
        "model.layers.11.feed_forward.w1.weight": "model.safetensors",
        "model.layers.11.feed_forward.w2.biases": "model.safetensors",
        "model.layers.11.feed_forward.w2.scales": "model.safetensors",
        "model.layers.11.feed_forward.w2.weight": "model.safetensors",
        "model.layers.11.feed_forward.w3.biases": "model.safetensors",
        "model.layers.11.feed_forward.w3.scales": "model.safetensors",
        "model.layers.11.feed_forward.w3.weight": "model.safetensors",
        "model.layers.11.ffn_norm.weight": "model.safetensors",
        "model.layers.11.operator_norm.weight": "model.safetensors",
        "model.layers.12.feed_forward.w1.biases": "model.safetensors",
        "model.layers.12.feed_forward.w1.scales": "model.safetensors",
        "model.layers.12.feed_forward.w1.weight": "model.safetensors",
        "model.layers.12.feed_forward.w2.biases": "model.safetensors",
        "model.layers.12.feed_forward.w2.scales": "model.safetensors",
        "model.layers.12.feed_forward.w2.weight": "model.safetensors",
        "model.layers.12.feed_forward.w3.biases": "model.safetensors",
        "model.layers.12.feed_forward.w3.scales": "model.safetensors",
        "model.layers.12.feed_forward.w3.weight": "model.safetensors",
        "model.layers.12.ffn_norm.weight": "model.safetensors",
        "model.layers.12.operator_norm.weight": "model.safetensors",
        "model.layers.12.self_attn.k_layernorm.weight": "model.safetensors",
        "model.layers.12.self_attn.k_proj.biases": "model.safetensors",
        "model.layers.12.self_attn.k_proj.scales": "model.safetensors",
        "model.layers.12.self_attn.k_proj.weight": "model.safetensors",
        "model.layers.12.self_attn.out_proj.biases": "model.safetensors",
        "model.layers.12.self_attn.out_proj.scales": "model.safetensors",
        "model.layers.12.self_attn.out_proj.weight": "model.safetensors",
        "model.layers.12.self_attn.q_layernorm.weight": "model.safetensors",
        "model.layers.12.self_attn.q_proj.biases": "model.safetensors",
        "model.layers.12.self_attn.q_proj.scales": "model.safetensors",
        "model.layers.12.self_attn.q_proj.weight": "model.safetensors",
        "model.layers.12.self_attn.v_proj.biases": "model.safetensors",
        "model.layers.12.self_attn.v_proj.scales": "model.safetensors",
        "model.layers.12.self_attn.v_proj.weight": "model.safetensors",
        "model.layers.13.conv.conv.weight": "model.safetensors",
        "model.layers.13.conv.in_proj.biases": "model.safetensors",
        "model.layers.13.conv.in_proj.scales": "model.safetensors",
        "model.layers.13.conv.in_proj.weight": "model.safetensors",
        "model.layers.13.conv.out_proj.biases": "model.safetensors",
        "model.layers.13.conv.out_proj.scales": "model.safetensors",
        "model.layers.13.conv.out_proj.weight": "model.safetensors",
        "model.layers.13.feed_forward.w1.biases": "model.safetensors",
        "model.layers.13.feed_forward.w1.scales": "model.safetensors",
        "model.layers.13.feed_forward.w1.weight": "model.safetensors",
        "model.layers.13.feed_forward.w2.biases": "model.safetensors",
        "model.layers.13.feed_forward.w2.scales": "model.safetensors",
        "model.layers.13.feed_forward.w2.weight": "model.safetensors",
        "model.layers.13.feed_forward.w3.biases": "model.safetensors",
        "model.layers.13.feed_forward.w3.scales": "model.safetensors",
        "model.layers.13.feed_forward.w3.weight": "model.safetensors",
        "model.layers.13.ffn_norm.weight": "model.safetensors",
        "model.layers.13.operator_norm.weight": "model.safetensors",
        "model.layers.14.feed_forward.w1.biases": "model.safetensors",
        "model.layers.14.feed_forward.w1.scales": "model.safetensors",
        "model.layers.14.feed_forward.w1.weight": "model.safetensors",
        "model.layers.14.feed_forward.w2.biases": "model.safetensors",
        "model.layers.14.feed_forward.w2.scales": "model.safetensors",
        "model.layers.14.feed_forward.w2.weight": "model.safetensors",
        "model.layers.14.feed_forward.w3.biases": "model.safetensors",
        "model.layers.14.feed_forward.w3.scales": "model.safetensors",
        "model.layers.14.feed_forward.w3.weight": "model.safetensors",
        "model.layers.14.ffn_norm.weight": "model.safetensors",
        "model.layers.14.operator_norm.weight": "model.safetensors",
        "model.layers.14.self_attn.k_layernorm.weight": "model.safetensors",
        "model.layers.14.self_attn.k_proj.biases": "model.safetensors",
        "model.layers.14.self_attn.k_proj.scales": "model.safetensors",
        "model.layers.14.self_attn.k_proj.weight": "model.safetensors",
        "model.layers.14.self_attn.out_proj.biases": "model.safetensors",
        "model.layers.14.self_attn.out_proj.scales": "model.safetensors",
        "model.layers.14.self_attn.out_proj.weight": "model.safetensors",
        "model.layers.14.self_attn.q_layernorm.weight": "model.safetensors",
        "model.layers.14.self_attn.q_proj.biases": "model.safetensors",
        "model.layers.14.self_attn.q_proj.scales": "model.safetensors",
        "model.layers.14.self_attn.q_proj.weight": "model.safetensors",
        "model.layers.14.self_attn.v_proj.biases": "model.safetensors",
        "model.layers.14.self_attn.v_proj.scales": "model.safetensors",
        "model.layers.14.self_attn.v_proj.weight": "model.safetensors",
        "model.layers.15.conv.conv.weight": "model.safetensors",
        "model.layers.15.conv.in_proj.biases": "model.safetensors",
        "model.layers.15.conv.in_proj.scales": "model.safetensors",
        "model.layers.15.conv.in_proj.weight": "model.safetensors",
        "model.layers.15.conv.out_proj.biases": "model.safetensors",
        "model.layers.15.conv.out_proj.scales": "model.safetensors",
        "model.layers.15.conv.out_proj.weight": "model.safetensors",
        "model.layers.15.feed_forward.w1.biases": "model.safetensors",
        "model.layers.15.feed_forward.w1.scales": "model.safetensors",
        "model.layers.15.feed_forward.w1.weight": "model.safetensors",
        "model.layers.15.feed_forward.w2.biases": "model.safetensors",
        "model.layers.15.feed_forward.w2.scales": "model.safetensors",
        "model.layers.15.feed_forward.w2.weight": "model.safetensors",
        "model.layers.15.feed_forward.w3.biases": "model.safetensors",
        "model.layers.15.feed_forward.w3.scales": "model.safetensors",
        "model.layers.15.feed_forward.w3.weight": "model.safetensors",
        "model.layers.15.ffn_norm.weight": "model.safetensors",
        "model.layers.15.operator_norm.weight": "model.safetensors",
        "model.layers.2.feed_forward.w1.biases": "model.safetensors",
        "model.layers.2.feed_forward.w1.scales": "model.safetensors",
        "model.layers.2.feed_forward.w1.weight": "model.safetensors",
        "model.layers.2.feed_forward.w2.biases": "model.safetensors",
        "model.layers.2.feed_forward.w2.scales": "model.safetensors",
        "model.layers.2.feed_forward.w2.weight": "model.safetensors",
        "model.layers.2.feed_forward.w3.biases": "model.safetensors",
        "model.layers.2.feed_forward.w3.scales": "model.safetensors",
        "model.layers.2.feed_forward.w3.weight": "model.safetensors",
        "model.layers.2.ffn_norm.weight": "model.safetensors",
        "model.layers.2.operator_norm.weight": "model.safetensors",
        "model.layers.2.self_attn.k_layernorm.weight": "model.safetensors",
        "model.layers.2.self_attn.k_proj.biases": "model.safetensors",
        "model.layers.2.self_attn.k_proj.scales": "model.safetensors",
        "model.layers.2.self_attn.k_proj.weight": "model.safetensors",
        "model.layers.2.self_attn.out_proj.biases": "model.safetensors",
        "model.layers.2.self_attn.out_proj.scales": "model.safetensors",
        "model.layers.2.self_attn.out_proj.weight": "model.safetensors",
        "model.layers.2.self_attn.q_layernorm.weight": "model.safetensors",
        "model.layers.2.self_attn.q_proj.biases": "model.safetensors",
        "model.layers.2.self_attn.q_proj.scales": "model.safetensors",
        "model.layers.2.self_attn.q_proj.weight": "model.safetensors",
        "model.layers.2.self_attn.v_proj.biases": "model.safetensors",
        "model.layers.2.self_attn.v_proj.scales": "model.safetensors",
        "model.layers.2.self_attn.v_proj.weight": "model.safetensors",
        "model.layers.3.conv.conv.weight": "model.safetensors",
        "model.layers.3.conv.in_proj.biases": "model.safetensors",
        "model.layers.3.conv.in_proj.scales": "model.safetensors",
        "model.layers.3.conv.in_proj.weight": "model.safetensors",
        "model.layers.3.conv.out_proj.biases": "model.safetensors",
        "model.layers.3.conv.out_proj.scales": "model.safetensors",
        "model.layers.3.conv.out_proj.weight": "model.safetensors",
        "model.layers.3.feed_forward.w1.biases": "model.safetensors",
        "model.layers.3.feed_forward.w1.scales": "model.safetensors",
        "model.layers.3.feed_forward.w1.weight": "model.safetensors",
        "model.layers.3.feed_forward.w2.biases": "model.safetensors",
        "model.layers.3.feed_forward.w2.scales": "model.safetensors",
        "model.layers.3.feed_forward.w2.weight": "model.safetensors",
        "model.layers.3.feed_forward.w3.biases": "model.safetensors",
        "model.layers.3.feed_forward.w3.scales": "model.safetensors",
        "model.layers.3.feed_forward.w3.weight": "model.safetensors",
        "model.layers.3.ffn_norm.weight": "model.safetensors",
        "model.layers.3.operator_norm.weight": "model.safetensors",
        "model.layers.4.conv.conv.weight": "model.safetensors",
        "model.layers.4.conv.in_proj.biases": "model.safetensors",
        "model.layers.4.conv.in_proj.scales": "model.safetensors",
        "model.layers.4.conv.in_proj.weight": "model.safetensors",
        "model.layers.4.conv.out_proj.biases": "model.safetensors",
        "model.layers.4.conv.out_proj.scales": "model.safetensors",
        "model.layers.4.conv.out_proj.weight": "model.safetensors",
        "model.layers.4.feed_forward.w1.biases": "model.safetensors",
        "model.layers.4.feed_forward.w1.scales": "model.safetensors",
        "model.layers.4.feed_forward.w1.weight": "model.safetensors",
        "model.layers.4.feed_forward.w2.biases": "model.safetensors",
        "model.layers.4.feed_forward.w2.scales": "model.safetensors",
        "model.layers.4.feed_forward.w2.weight": "model.safetensors",
        "model.layers.4.feed_forward.w3.biases": "model.safetensors",
        "model.layers.4.feed_forward.w3.scales": "model.safetensors",
        "model.layers.4.feed_forward.w3.weight": "model.safetensors",
        "model.layers.4.ffn_norm.weight": "model.safetensors",
        "model.layers.4.operator_norm.weight": "model.safetensors",
        "model.layers.5.feed_forward.w1.biases": "model.safetensors",
        "model.layers.5.feed_forward.w1.scales": "model.safetensors",
        "model.layers.5.feed_forward.w1.weight": "model.safetensors",
        "model.layers.5.feed_forward.w2.biases": "model.safetensors",
        "model.layers.5.feed_forward.w2.scales": "model.safetensors",
        "model.layers.5.feed_forward.w2.weight": "model.safetensors",
        "model.layers.5.feed_forward.w3.biases": "model.safetensors",
        "model.layers.5.feed_forward.w3.scales": "model.safetensors",
        "model.layers.5.feed_forward.w3.weight": "model.safetensors",
        "model.layers.5.ffn_norm.weight": "model.safetensors",
        "model.layers.5.operator_norm.weight": "model.safetensors",
        "model.layers.5.self_attn.k_layernorm.weight": "model.safetensors",
        "model.layers.5.self_attn.k_proj.biases": "model.safetensors",
        "model.layers.5.self_attn.k_proj.scales": "model.safetensors",
        "model.layers.5.self_attn.k_proj.weight": "model.safetensors",
        "model.layers.5.self_attn.out_proj.biases": "model.safetensors",
        "model.layers.5.self_attn.out_proj.scales": "model.safetensors",
        "model.layers.5.self_attn.out_proj.weight": "model.safetensors",
        "model.layers.5.self_attn.q_layernorm.weight": "model.safetensors",
        "model.layers.5.self_attn.q_proj.biases": "model.safetensors",
        "model.layers.5.self_attn.q_proj.scales": "model.safetensors",
        "model.layers.5.self_attn.q_proj.weight": "model.safetensors",
        "model.layers.5.self_attn.v_proj.biases": "model.safetensors",
        "model.layers.5.self_attn.v_proj.scales": "model.safetensors",
        "model.layers.5.self_attn.v_proj.weight": "model.safetensors",
        "model.layers.6.conv.conv.weight": "model.safetensors",
        "model.layers.6.conv.in_proj.biases": "model.safetensors",
        "model.layers.6.conv.in_proj.scales": "model.safetensors",
        "model.layers.6.conv.in_proj.weight": "model.safetensors",
        "model.layers.6.conv.out_proj.biases": "model.safetensors",
        "model.layers.6.conv.out_proj.scales": "model.safetensors",
        "model.layers.6.conv.out_proj.weight": "model.safetensors",
        "model.layers.6.feed_forward.w1.biases": "model.safetensors",
        "model.layers.6.feed_forward.w1.scales": "model.safetensors",
        "model.layers.6.feed_forward.w1.weight": "model.safetensors",
        "model.layers.6.feed_forward.w2.biases": "model.safetensors",
        "model.layers.6.feed_forward.w2.scales": "model.safetensors",
        "model.layers.6.feed_forward.w2.weight": "model.safetensors",
        "model.layers.6.feed_forward.w3.biases": "model.safetensors",
        "model.layers.6.feed_forward.w3.scales": "model.safetensors",
        "model.layers.6.feed_forward.w3.weight": "model.safetensors",
        "model.layers.6.ffn_norm.weight": "model.safetensors",
        "model.layers.6.operator_norm.weight": "model.safetensors",
        "model.layers.7.conv.conv.weight": "model.safetensors",
        "model.layers.7.conv.in_proj.biases": "model.safetensors",
        "model.layers.7.conv.in_proj.scales": "model.safetensors",
        "model.layers.7.conv.in_proj.weight": "model.safetensors",
        "model.layers.7.conv.out_proj.biases": "model.safetensors",
        "model.layers.7.conv.out_proj.scales": "model.safetensors",
        "model.layers.7.conv.out_proj.weight": "model.safetensors",
        "model.layers.7.feed_forward.w1.biases": "model.safetensors",
        "model.layers.7.feed_forward.w1.scales": "model.safetensors",
        "model.layers.7.feed_forward.w1.weight": "model.safetensors",
        "model.layers.7.feed_forward.w2.biases": "model.safetensors",
        "model.layers.7.feed_forward.w2.scales": "model.safetensors",
        "model.layers.7.feed_forward.w2.weight": "model.safetensors",
        "model.layers.7.feed_forward.w3.biases": "model.safetensors",
        "model.layers.7.feed_forward.w3.scales": "model.safetensors",
        "model.layers.7.feed_forward.w3.weight": "model.safetensors",
        "model.layers.7.ffn_norm.weight": "model.safetensors",
        "model.layers.7.operator_norm.weight": "model.safetensors",
        "model.layers.8.feed_forward.w1.biases": "model.safetensors",
        "model.layers.8.feed_forward.w1.scales": "model.safetensors",
        "model.layers.8.feed_forward.w1.weight": "model.safetensors",
        "model.layers.8.feed_forward.w2.biases": "model.safetensors",
        "model.layers.8.feed_forward.w2.scales": "model.safetensors",
        "model.layers.8.feed_forward.w2.weight": "model.safetensors",
        "model.layers.8.feed_forward.w3.biases": "model.safetensors",
        "model.layers.8.feed_forward.w3.scales": "model.safetensors",
        "model.layers.8.feed_forward.w3.weight": "model.safetensors",
        "model.layers.8.ffn_norm.weight": "model.safetensors",
        "model.layers.8.operator_norm.weight": "model.safetensors",
        "model.layers.8.self_attn.k_layernorm.weight": "model.safetensors",
        "model.layers.8.self_attn.k_proj.biases": "model.safetensors",
        "model.layers.8.self_attn.k_proj.scales": "model.safetensors",
        "model.layers.8.self_attn.k_proj.weight": "model.safetensors",
        "model.layers.8.self_attn.out_proj.biases": "model.safetensors",
        "model.layers.8.self_attn.out_proj.scales": "model.safetensors",
        "model.layers.8.self_attn.out_proj.weight": "model.safetensors",
        "model.layers.8.self_attn.q_layernorm.weight": "model.safetensors",
        "model.layers.8.self_attn.q_proj.biases": "model.safetensors",
        "model.layers.8.self_attn.q_proj.scales": "model.safetensors",
        "model.layers.8.self_attn.q_proj.weight": "model.safetensors",
        "model.layers.8.self_attn.v_proj.biases": "model.safetensors",
        "model.layers.8.self_attn.v_proj.scales": "model.safetensors",
        "model.layers.8.self_attn.v_proj.weight": "model.safetensors",
        "model.layers.9.conv.conv.weight": "model.safetensors",
        "model.layers.9.conv.in_proj.biases": "model.safetensors",
        "model.layers.9.conv.in_proj.scales": "model.safetensors",
        "model.layers.9.conv.in_proj.weight": "model.safetensors",
        "model.layers.9.conv.out_proj.biases": "model.safetensors",
        "model.layers.9.conv.out_proj.scales": "model.safetensors",
        "model.layers.9.conv.out_proj.weight": "model.safetensors",
        "model.layers.9.feed_forward.w1.biases": "model.safetensors",
        "model.layers.9.feed_forward.w1.scales": "model.safetensors",
        "model.layers.9.feed_forward.w1.weight": "model.safetensors",
        "model.layers.9.feed_forward.w2.biases": "model.safetensors",
        "model.layers.9.feed_forward.w2.scales": "model.safetensors",
        "model.layers.9.feed_forward.w2.weight": "model.safetensors",
        "model.layers.9.feed_forward.w3.biases": "model.safetensors",
        "model.layers.9.feed_forward.w3.scales": "model.safetensors",
        "model.layers.9.feed_forward.w3.weight": "model.safetensors",
        "model.layers.9.ffn_norm.weight": "model.safetensors",
        "model.layers.9.operator_norm.weight": "model.safetensors"
    }
}